awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F001Bxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Flash</description>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>KEYR</name>
          <description>Flash key register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>Flash CR key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <description>Option byte key register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>Flash Option key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EOP</name>
              <description>End of operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRPERR</name>
              <description>Write protection error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>Option and trimming bits loading validity error</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BSY</name>
              <description>Busy</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Flash control register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PG</name>
              <description>Page Program</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PER</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MER</name>
              <description>Mass Erase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SER</name>
              <description>Sector Erase</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>Option bytes Programming Start</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PGSTRT</name>
              <description>Programming Start</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EOPIE</name>
              <description>End of operation interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>Force the option bytes loading</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>Option Lock</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <description>Flash option register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RDP</name>
              <description>Read Protection</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>BOR_EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BOR_LEV</name>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>IWDG_SW</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>NRST_MODE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>IWDG Software Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDKR</name>
          <description>Flash SDK address register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>SDK_STRT</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SDK_END</name>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR</name>
          <description>Flash WRP address register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>WRP</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STCR</name>
          <description>Flash sleep time config register</description>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>Sleep enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <description>Flash TS0 register</description>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>TS0</name>
              <description>TS0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <description>Flash TS1 register</description>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>TS1</name>
              <description>TS1</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <description>Flash TS2P register</description>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>TS2P</name>
              <description>TS2P</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <description>Flash TPS3 register</description>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>TPS3</name>
              <description>TPS3</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <description>Flash TS3 register</description>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>TS3</name>
              <description>TS3</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ERTPE</name>
          <addressOffset>0x114</addressOffset>
          <fields>
            <field>
              <name>ERTPE</name>
              <description>ERTPE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <description>Flash PRGTPE register</description>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>PRGTPE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <description>Flash PRETPE register</description>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>PRETPE</description>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
