awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F001Bxx.svd
        <register>
          <name>RCR</name>
          <description>desc RCR</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>REP</name>
              <description>desc REP</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <description>desc CCR1</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CCR1_H</name>
              <description>desc CCR1_H</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CCR2</name>
              <description>desc CCR2</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CCR2_H</name>
              <description>desc CCR2_H</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>desc CCR3</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CCR3</name>
              <description>desc CCR3</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CCR3_H</name>
              <description>desc CCR3_H</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>desc CCR4</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CCR4</name>
              <description>desc CCR4</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>desc BDTR</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DTG</name>
              <description>desc DTG</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>desc LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <description>desc OSSI</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <description>desc OSSR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <description>desc BKE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <description>desc BKP</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <description>desc AOE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <description>desc MOE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>TI1SEL</name>
              <description>desc TI1SEL</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>TI2SEL</name>
              <description>desc TI2SEL</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>TI3SEL</name>
              <description>desc TI3SEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TI4SEL</name>
              <description>desc TI4SEL</description>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>BKINE</name>
              <description>desc BKINE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKCMP1E</name>
              <description>desc BKCMP1E</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BKCMP2E</name>
              <description>desc BKCMP2E</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKINP</name>
              <description>desc BKINP</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BKCMP1P</name>
              <description>desc BKCMP1P</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BKCMP2P</name>
              <description>desc BKCMP2P</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ETRSEL</name>
              <description>desc ETRSEL</description>
              <bitRange>[17:14]</bitRange>
            </field>
            <field>
              <name>INTR_SEL</name>
              <description>desc INTR_SEL</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PWM_PHS_EN</name>
              <description>desc PWM_PHS_EN</description>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>OCRSEL</name>
              <description>desc OCRSEL</description>
              <bitRange>[18:16]</bitRange>
            </field>
          </fields>
        </register>
